; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p1-0 - location
	p1-4 - location
	p1-6 - location
	p2-5 - location
	p3-1 - location
	p5-0 - location
	p5-7 - location
	p6-2 - location
	p6-3 - location
	p7-1 - location
	p7-2 - location
	p7-3 - location
	p7-6 - location
	p7-8 - location
	p8-1 - location
	p8-2 - location
	p8-4 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s4)
	(at driver4 s8)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s4)
	(at package2 s2)
	(at package3 s2)
	(at package4 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 87)
	(= (time-to-drive s2 s0) 87)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 34)
	(= (time-to-drive s7 s0) 34)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 7)
	(= (time-to-drive s0 s1) 7)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 5)
	(= (time-to-drive s3 s1) 5)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 9)
	(= (time-to-drive s5 s1) 9)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 40)
	(= (time-to-drive s1 s2) 40)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 19)
	(= (time-to-drive s3 s2) 19)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 16)
	(= (time-to-drive s7 s2) 16)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 85)
	(= (time-to-drive s0 s3) 85)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 37)
	(= (time-to-drive s7 s3) 37)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 100)
	(= (time-to-drive s0 s4) 100)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 81)
	(= (time-to-drive s3 s4) 81)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 39)
	(= (time-to-drive s0 s5) 39)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 43)
	(= (time-to-drive s4 s5) 43)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 45)
	(= (time-to-drive s6 s5) 45)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 25)
	(= (time-to-drive s8 s5) 25)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 40)
	(= (time-to-drive s0 s6) 40)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 12)
	(= (time-to-drive s2 s6) 12)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 100)
	(= (time-to-drive s7 s6) 100)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 68)
	(= (time-to-drive s5 s7) 68)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 46)
	(= (time-to-drive s2 s8) 46)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 29)
	(= (time-to-drive s7 s8) 29)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s8)
	(at driver4 s3)
	(at truck2 s4)
	(at truck3 s6)
	(at package1 s0)
	(at package2 s5)
	(at package3 s8)
	(at package4 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver4 s8 p7-8)
   deleted: (at driver4 s8)
   added: (at driver4 p7-8)
   goals met: 0 of 8
2. (walk driver4 p7-8 s7)
   deleted: (at driver4 p7-8)
   added: (at driver4 s7)
   goals met: 0 of 8
3. (board-truck driver4 truck2 s7)
   deleted: (at driver4 s7) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 0 of 8
4. (drive-truck truck2 s7 s5 driver4)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 0 to 680
   goals met: 0 of 8
5. (drive-truck truck2 s5 s4 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 680 to 1110
   goals met: 1 of 8
6. (load-truck package1 truck2 s4)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 8
7. (load-truck package4 truck2 s4)
   deleted: (at package4 s4)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 8
8. (walk driver1 s0 p5-0)
   deleted: (at driver1 s0)
   added: (at driver1 p5-0)
   goals met: 1 of 8
9. (walk driver1 p5-0 s5)
   deleted: (at driver1 p5-0)
   added: (at driver1 s5)
   goals met: 1 of 8
10. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 8
11. (drive-truck truck3 s5 s8 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   changed: (fuel-used) from 1110 to 1360
   goals met: 1 of 8
12. (drive-truck truck3 s8 s2 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   changed: (fuel-used) from 1360 to 1820
   goals met: 1 of 8
13. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 8
14. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 1 of 8
15. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 1820 to 1976
   goals met: 2 of 8
16. (drive-truck truck2 s4 s0 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 1976 to 3276
   goals met: 1 of 8
17. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 2 of 8
18. (unload-truck package4 truck2 s0)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 8
19. (drive-truck truck2 s0 s3 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 3276 to 4126
   goals met: 3 of 8
20. (drive-truck truck3 s6 s5 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 4126 to 4711
   goals met: 2 of 8
21. (drive-truck truck3 s5 s8 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   changed: (fuel-used) from 4711 to 5036
   goals met: 2 of 8
22. (unload-truck package3 truck3 s8)
   deleted: (in package3 truck3)
   added: (at package3 s8)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 3 of 8
23. (drive-truck truck3 s8 s2 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   changed: (fuel-used) from 5036 to 5542
   goals met: 3 of 8
24. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 3 of 8
25. (drive-truck truck3 s2 s8 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   changed: (fuel-used) from 5542 to 6002
   goals met: 3 of 8
26. (drive-truck truck3 s8 s5 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s5)
   changed: (fuel-used) from 6002 to 6252
   goals met: 3 of 8
27. (drive-truck truck2 s3 s2 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 6252 to 6442
   goals met: 3 of 8
28. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 8
29. (drive-truck truck2 s2 s3 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 6442 to 6651
   goals met: 3 of 8
30. (drive-truck truck2 s3 s4 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 6651 to 7542
   goals met: 4 of 8
31. (drive-truck truck3 s5 s8 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   changed: (fuel-used) from 7542 to 7792
   goals met: 4 of 8
32. (drive-truck truck2 s4 s5 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 7792 to 8265
   goals met: 3 of 8
33. (unload-truck package2 truck2 s5)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 4 of 8
34. (disembark-truck driver4 truck2 s5)
   deleted: (driving driver4 truck2)
   added: (at driver4 s5) (empty truck2)
   goals met: 4 of 8
35. (disembark-truck driver1 truck3 s8)
   deleted: (driving driver1 truck3)
   added: (at driver1 s8) (empty truck3)
   goals met: 5 of 8
36. (walk driver4 s5 p5-7)
   deleted: (at driver4 s5)
   added: (at driver4 p5-7)
   goals met: 5 of 8
37. (board-truck driver1 truck3 s8)
   deleted: (at driver1 s8) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 8
38. (walk driver4 p5-7 s7)
   deleted: (at driver4 p5-7)
   added: (at driver4 s7)
   goals met: 4 of 8
39. (walk driver4 s7 p7-3)
   deleted: (at driver4 s7)
   added: (at driver4 p7-3)
   goals met: 4 of 8
40. (drive-truck truck3 s8 s5 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s5)
   changed: (fuel-used) from 8265 to 8515
   goals met: 4 of 8
41. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 4 of 8
42. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 8
43. (drive-truck truck2 s5 s4 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 8515 to 8945
   goals met: 5 of 8
44. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 5 of 8
45. (walk driver4 p7-3 s7)
   deleted: (at driver4 p7-3)
   added: (at driver4 s7)
   goals met: 5 of 8
46. (walk driver1 s4 p8-4)
   deleted: (at driver1 s4)
   added: (at driver1 p8-4)
   goals met: 5 of 8
47. (walk driver1 p8-4 s8)
   deleted: (at driver1 p8-4)
   added: (at driver1 s8)
   goals met: 6 of 8
48. (walk driver4 s7 p5-7)
   deleted: (at driver4 s7)
   added: (at driver4 p5-7)
   goals met: 6 of 8
49. (walk driver4 p5-7 s5)
   deleted: (at driver4 p5-7)
   added: (at driver4 s5)
   goals met: 6 of 8
50. (board-truck driver4 truck3 s5)
   deleted: (at driver4 s5) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 6 of 8
51. (drive-truck truck3 s5 s6 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 8945 to 9395
   goals met: 7 of 8
52. (disembark-truck driver4 truck3 s6)
   deleted: (driving driver4 truck3)
   added: (at driver4 s6) (empty truck3)
   goals met: 7 of 8
53. (walk driver4 s6 p6-3)
   deleted: (at driver4 s6)
   added: (at driver4 p6-3)
   goals met: 7 of 8
54. (walk driver4 p6-3 s3)
   deleted: (at driver4 p6-3)
   added: (at driver4 s3)
   goals met: 8 of 8
